ybyllc/stm32-tea-lib/2_Control/menu.c
/**
 * @file menu.c
 * @brief 菜单系统核心实现
 * @note 负责子菜单管理和菜单系统的整体逻辑
 */

/*
 * ==================== Menu方案风格约定（开发/AI参考）====================
 * 1) 页面职责单一：一个页面函数只负责“读取状态 + 渲染显示”，不做重型业务逻辑。
 * 2) 初始化懒加载：进入页面时再初始化模块（Menu_InitXXX），避免上电一次性初始化全部外设。
 * 3) 统一离线降级：驱动未链接/外设离线时，页面必须显示可读提示，不崩溃、不死循环。
 * 4) 输入/输出互斥：同一外设复用端口（如PPM/SBUS）时，页面内只启用一种模式并明确提示。
 * 5) 显示风格统一：标题在第0行，状态在第1行，数据主体在中间，最后一行保留返回提示。
 * 6) 摇杆可视化统一：通道值先归一化，再用DrawStickBar绘制，128为中位，左右对称填充。
 * 7) 参数边界保护：所有通道值在显示前先限幅，防止异常值导致UI错位或数值溢出。
 * 8) 可维护优先：公共逻辑提取为静态函数，禁止在多个页面复制粘贴同一段处理代码。
 * 9) 修改原则：新增页面先补函数声明，再补初始化、渲染、按键处理、菜单入口四处映射。
 * 10) 调试友好：错误信息尽量给出“检查方向”（引脚/波特率/中断/驱动是否加入工程）。
 * ======================================================================
 */

#include "menu.h"
#include "menu_input.h"
#include "oled_ui_mode.h"
#include "wit_gyro_sdk.h"
#include "icm42670.h"
#include "TOF_VL53L0X.h"
#include "remote_key.h"
#include "ppm_input.h"
#include "sbus_input.h"
#include "motor_tb6612.h"
#include "motor_standard.h"
#include "PWM_standard.h"
#include "servo_pwm.h"
#include "key_pc6.h"
#include "encoder.h"
#include "car_task.h"
#include "oled.h"
#include "ax_ps2.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_adc.h"
#include "stm32f4xx_hal_gpio.h"
#include <stdio.h>
#include <stdlib.h>


// 陀螺仪类型枚举
typedef enum {
    GYRO_TYPE_NONE,        // 无陀螺仪
    GYRO_TYPE_WIT,         // 原来的陀螺仪
    GYRO_TYPE_ICM42670     // ICM42670 陀螺仪
} GyroType;

// 模块初始化状态标志
uint8_t gyro_initialized = 0;    // 陀螺仪是否已初始化
uint8_t tof_initialized = 0;     // TOF是否已初始化
uint8_t remote_key_initialized = 0; // 遥控器是否已初始化
uint8_t ppm_initialized = 0;      // PPM输入是否已初始化
uint8_t sbus_initialized = 0;     // SBUS输入是否已初始化
uint8_t motor_initialized = 0;   // 电机是否已初始化
uint8_t adc_initialized = 0;     // ADC是否已初始化
uint8_t ps2_initialized = 0;     // PS2手柄是否已初始化
uint8_t gpio_initialized = 0;    // GPIO测试是否已初始化

// ADC句柄
extern ADC_HandleTypeDef hadc1;

// 电机测试状态
int16_t motor_speeds[4] = {0, 0, 0, 0}; // 四个电机的速度值（-1000到1000）
uint8_t current_motor_index = 0; // 当前选中的电机索引（0-3）
uint8_t motor_speed_adjust_mode = 0; // 速度调整模式：0-选择电机模式，1-调整速度模式

// 系统状态变量
uint8_t system_mode = 0; // 0-菜单模式, 1-任务模式
uint32_t task_start_time = 0; // 任务开始时间

// 编码器累计值
int32_t encoder1_total_count = 0; // 编码器1的累计值
int32_t encoder2_total_count = 0; // 编码器2的累计值

// 当前使用的陀螺仪类型
static GyroType current_gyro_type = GYRO_TYPE_NONE;

// 外部函数声明
extern void Gryo_Update(void);
extern u8 VL53L0X_IsReady(void);
extern u16 TOF_QuickTest(void);

// 静态函数声明
static void Menu_DisplayGyroPage(void);
static void Menu_DisplayEc11TestPage(void);
static void Menu_DisplayTofTestPage(void);
static void Menu_DisplayFieldTaskPage(void);
static void Menu_DisplayRemoteKeyTestPage(void);
static void Menu_DisplayPPMInputTestPage(void);
static void Menu_DisplaySBUSInputTestPage(void);
static void Menu_DisplayMotorTestPage(void);
static void Menu_DisplayEncoderTestPage(void);
static void Menu_DisplayAdcTestPage(void);
static void Menu_DisplayPS2TestPage(void);
static void Menu_DisplayPS2ControlPage(void);
static void Menu_DisplayGPIOTestPage(void);
static void Menu_DisplayMainMenu(void);
static void Menu_DisplayCurrentPage(void);
static u8 Menu_IsPPMDriverLinked(void);
static u8 Menu_IsSBUSDriverLinked(void);
static CarTaskModeTypeDef Menu_GetPendingTaskMode(void);

/**
 * @brief 判断PPM驱动是否已链接到当前工程
 * @retval 1-已链接, 0-未链接
 */
static u8 Menu_IsPPMDriverLinked(void) {
    return 1U;
}

/**
 * @brief 判断SBUS输入驱动是否已链接到当前工程
 * @retval 1-已链接, 0-未链接
 */
static u8 Menu_IsSBUSDriverLinked(void) {
    return 1U;
}

/**
 * @brief 根据当前菜单位置决定即将启动的任务模式
 * @retval 小车任务模式
 * @note 仅当主菜单光标停留在 Field Task 项时，PC6 启动水田遍历任务
 */
static CarTaskModeTypeDef Menu_GetPendingTaskMode(void) {
    if ((menuState.currentPage == MENU_PAGE_MAIN) &&
        (mainMenuItems[menuState.currentItem].page == MENU_PAGE_FIELD_TASK)) {
        return CAR_TASK_MODE_FIELD_SCAN;
    }

    if (menuState.currentPage == MENU_PAGE_FIELD_TASK) {
        return CAR_TASK_MODE_FIELD_SCAN;
    }

    return CAR_TASK_MODE_STRAIGHT;
}

/**
 * @brief 绘制摇杆进度条（带中心点）
 * @param x: 起始x坐标
 * @param y: 起始y坐标
 * @param width: 进度条总宽度
 * @param value: 摇杆值 (0-255, 128为中位)
 */
static void DrawStickBar(u8 x, u8 y, u8 width, u8 value) {
    u8 height = 9;  // 进度条高度
    u8 center_x = x + width / 2;  // 中心位置（中位点）
    
    // 绘制外框
    OLED_DrawRectangle(x, y, x + width - 1, y + height - 1, 1);
    
    // 计算填充位置（value: 0-255 -> 0-width）
    // 128为中位，小于128向左填充，大于128向右填充
    if (value > 128) {
        // 向右填充
        u8 fill_width = ((value - 128) * (width / 2)) / 128;
        if (fill_width > 0) {
            OLED_DrawFillRectangle(center_x, y + 1, center_x + fill_width, y + height - 2, 1);
        }
    } else if (value < 128) {
        // 向左填充
        u8 fill_width = ((128 - value) * (width / 2)) / 128;
        if (fill_width > 0) {
            OLED_DrawFillRectangle(center_x - fill_width, y + 1, center_x, y + height - 2, 1);
        }
    }
    
    // 绘制中心线
    OLED_DrawLine(center_x, y, center_x, y + height - 1, 1);
}

/**
 * @brief 初始化ADC（仅在第一次进入ADC页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitAdc(void) {
    if (adc_initialized) {
        return 1;  // 已经初始化过
    }
    
    // 启用GPIOC时钟
    __HAL_RCC_GPIOC_CLK_ENABLE();
    
    // 启用ADC1时钟
    __HAL_RCC_ADC1_CLK_ENABLE();
    
    // 配置PC4引脚为ADC输入
    GPIO_InitTypeDef GPIO_InitStruct = {
        .Pin = GPIO_PIN_4,
        .Mode = GPIO_MODE_ANALOG,
        .Pull = GPIO_NOPULL
    };
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    
    // 配置ADC
    hadc1.Instance = ADC1;
    hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution = ADC_RESOLUTION_12B;
    hadc1.Init.ScanConvMode = DISABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;  // 单次转换模式
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion = 1;
    hadc1.Init.DMAContinuousRequests = DISABLE;
    hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    
    if (HAL_ADC_Init(&hadc1) != HAL_OK) {
        return 0;  // 初始化失败
    }
    
    // 配置ADC通道
    ADC_ChannelConfTypeDef sConfig = {
        .Channel = ADC_CHANNEL_14,  // PC4对应ADC1通道14
        .Rank = 1,
        .SamplingTime = ADC_SAMPLETIME_480CYCLES  // 使用较长的采样时间
    };
    
