ybyllc/stm32-tea-lib/2_Control/menu.c
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        return 0;  // 通道配置失败
    }
    
    adc_initialized = 1;
    return 1;
}

/**
 * @brief 初始化PS2手柄（仅在第一次进入PS2页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitPS2(void) {
    if (ps2_initialized) {
        return 1;  // 已经初始化过
    }
    
    // 初始化PS2手柄
    AX_PS2_Init();
    AX_PS2_SetInit();
    
    ps2_initialized = 1;
    return 1;
}

/**
 * @brief 初始化陀螺仪（仅在第一次进入Gyro页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitGyro(void) {
    if (gyro_initialized) {
        return 1;  // 已经初始化过
    }
    
    // 尝试初始化 ICM42670
    if (ICM42670_Init()) {
        current_gyro_type = GYRO_TYPE_ICM42670;
        gyro_initialized = 1;
        return 1;
    }
    
    // 如果 ICM42670 失败，尝试初始化串口陀螺仪（WIT）
    Gryo_init();  // 串口陀螺仪初始化
    current_gyro_type = GYRO_TYPE_WIT;
    gyro_initialized = 1;
    return 1;
}

/**
 * @brief 初始化TOF（仅在第一次进入TOF页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitTof(void) {
    if (tof_initialized) {
        return 1;  // 已经初始化过
    }
    
    if (VL53L0X_Init() == 0) {
        tof_initialized = 1;
        return 1;
    }
    
    return 0;  // 初始化失败
}

/**
 * @brief 初始化遥控器（仅在第一次进入Remote Key页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitRemoteKey(void) {
    if (remote_key_initialized) {
        return 1;  // 已经初始化过
    }

    RemoteKey_Init();
    remote_key_initialized = 1;
    return 1;
}

/**
 * @brief 初始化PPM输入（仅在第一次进入PPM页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitPPM(void) {
    if (ppm_initialized) {
        return 1;
    }

    if (Menu_IsPPMDriverLinked() == 0U) {
        return 0;
    }

    PPM_In_Init();
    ppm_initialized = 1;
    return 1;
}

/**
 * @brief 初始化SBUS输入（仅在第一次进入SBUS页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitSBUS(void) {
    if (sbus_initialized) {
        return 1;
    }

    if (Menu_IsSBUSDriverLinked() == 0U) {
        return 0;
    }

    SBUS_In_Init();
    sbus_initialized = 1;
    return 1;
}

/**
 * @brief 初始化电机（仅在第一次进入Motor Test页面时调用）
 * @retval 0-失败, 1-成功
 */
uint8_t Menu_InitMotor(void) {
    if (motor_initialized) {
        return 1;  // 已经初始化过
    }
    
    Motor_Init();
    motor_initialized = 1;
    return 1;
}

/**
 * @brief  通用陀螺仪更新函数，根据当前使用的陀螺仪类型调用对应的更新函数
 * @param  无
 * @retval 无
 */
void Menu_Gryo_Update(void) {
    switch (current_gyro_type) {
        case GYRO_TYPE_ICM42670:
            // 使用 ICM42670 陀螺仪
            ICM42670_Gryo_Update();
            break;
        case GYRO_TYPE_WIT:
            // 使用原来的陀螺仪
            Gryo_Update();
            break;
        case GYRO_TYPE_NONE:
        default:
            // 无陀螺仪，不做任何操作
            break;
    }
}

// 主菜单项目定义
const MenuItem mainMenuItems[] = {
    {"Gyro Info", MENU_PAGE_GYRO},
    {"EC11 Test", MENU_PAGE_EC11_TEST},
    {"TOF Test", MENU_PAGE_TOF_TEST},
    {"Field Task", MENU_PAGE_FIELD_TASK},
    {"Remote Key Test", MENU_PAGE_REMOTE_KEY_TEST},
    {"PPM In Test", MENU_PAGE_PPM_INPUT_TEST},
    {"SBUS In Test", MENU_PAGE_SBUS_INPUT_TEST},
    {"Motor Test", MENU_PAGE_MOTOR_TEST},
    {"Encoder Test", MENU_PAGE_ENCODER_TEST},
    {"ADC Test", MENU_PAGE_ADC_TEST},
    {"PS2 Test", MENU_PAGE_PS2_TEST},
    {"PS2 Control", MENU_PAGE_PS2_CONTROL},
    {"Servo PWM", MENU_PAGE_SERVO_PWM},
    {"GPIO Test", MENU_PAGE_GPIO_TEST}
};

// 主菜单项目数量
uint8_t MAIN_MENU_ITEM_COUNT = (sizeof(mainMenuItems) / sizeof(MenuItem));

// 菜单状态
MenuState menuState;

/**
 * @brief 菜单系统初始化
 */
void Menu_Init(void) {
    menuState.currentPage = MENU_PAGE_MAIN;
    menuState.currentItem = 0;
    menuState.lastEncoderCount = 0;
    menuState.isInMenu = 1;

    // 初始化输入处理
    MenuInput_Init();

    // 传统模式初始化OLED
    OLED_Init();
    OLED_Clear(0);
    
    // 显示初始页面
    Menu_DisplayMainMenu();
}

/**
 * @brief 主任务函数
 * @note 启动car_task，让陀螺仪z轴保持在30度来笔直前进
 */
static void Menu_RunMainTask(void) {
    CarTaskModeTypeDef task_mode = Menu_GetPendingTaskMode();

    OLED_Clear(0);
    
    // 在屏幕中间显示反色的 "Task Start"
    OLED_ShowString_Reverse(40, 3, "Task Start", 16);
    
    OLED_Refresh();
    
    // 初始化car_task
    Car_Task_SetMode(task_mode);
    Car_Task_Init();
    
    // 启动car_task
    Car_Task_Start();
    
    // 记录任务开始时间
    task_start_time = HAL_GetTick();
    
    // 切换到任务模式
    system_mode = 1;
}

/**
 * @brief 菜单系统运行
 * @note 在主循环中调用
 */
void Menu_Run(void) {
#if OLED_UI_MODE == OLED_UI_MODE_LVGL
    MenuUiMenLvg_Run();
    return;
#endif

    // 初始化PC6按键
    static uint8_t key_pc6_initialized = 0;
    if (!key_pc6_initialized) {
        KeyPC6_Init();
        key_pc6_initialized = 1;
    }
    
    // 检测PC6按键事件
    uint8_t key_pc6_event = KeyPC6_CheckEvent();
    if (key_pc6_event != 0) {
        if (key_pc6_event == 1) {
            if (system_mode == 0) {
                // 短按：启动主任务
                Menu_RunMainTask();
            } else {
                // 任务模式下短按：停止主任务
                Car_Task_Stop();
                system_mode = 0;
                OLED_Clear(0);
                OLED_ShowString(40, 3, "Task Stop", 16);
                OLED_Refresh();
                HAL_Delay(1000);
                OLED_Clear(0);
            }
        } else if (key_pc6_event == 2) {
            // 长按：系统重启
            HAL_NVIC_SystemReset();
        }
    }
    
    // 检查任务模式
    if (system_mode == 1) {
        // 执行car_task主函数
        Car_Task_Main();
        
        // 短暂延迟，避免执行过快
        HAL_Delay(5);
        
        return; // 任务模式下不执行菜单操作
    }
    
    // 获取编码器计数
    int32_t encoderCount = MenuInput_GetEncoderCount();
    
    // 处理编码器输入
    if (encoderCount != menuState.lastEncoderCount) {
        MenuInput_HandleEncoder(encoderCount);
        menuState.lastEncoderCount = encoderCount;
    }
    
    // 获取按键事件
    uint8_t keyEvent = MenuInput_GetEncoderKeyEvent();
    if (keyEvent != 0) {
        MenuInput_HandleKeyEvent(keyEvent);
    }
    
    // 扫描遥控器按键状态
    MenuInput_ScanRemoteKey();
    
    // 显示当前页面
    Menu_DisplayCurrentPage();
    
    // 短暂延迟，避免显示刷新过快
    HAL_Delay(5);
}

/**
 * @brief 获取当前菜单状态
 * @return 菜单状态指针
 */
MenuState* Menu_GetState(void) {
    return &menuState;
}

/**
 * @brief 添加新的子菜单
 * @param name 菜单项名称
 * @param page 菜单项对应的页面
 * @return 0-失败, 1-成功
 * @note 此函数需要在 Menu_Init() 之前调用
 */
uint8_t Menu_AddItem(const char* name, MenuPageType page) {
    // 注意：此函数目前仅作为接口，实际添加子菜单需要修改 mainMenuItems 数组
    // 后续可以实现动态添加子菜单的功能
    printf("Menu_AddItem: %s, page: %d\r\n", name, page);
    return 1;
}

/**
 * @brief 获取主菜单项数量
 * @return 主菜单项数量
 */
uint8_t Menu_GetMainItemCount(void) {
    return MAIN_MENU_ITEM_COUNT;
}

/**
 * @brief 获取主菜单项
 * @param index 菜单项索引
 * @return 菜单项指针
 */
const MenuItem* Menu_GetMainItem(uint8_t index) {
    if (index < MAIN_MENU_ITEM_COUNT) {
        return &mainMenuItems[index];
    }
    return NULL;
}

/**
 * @brief 显示陀螺仪信息页面
 */
static void Menu_DisplayGyroPage(void) {
    OLED_Clear(0);
    
    // 首次进入时初始化陀螺仪
    if (!gyro_initialized) {
        Menu_InitGyro();
    }
    
    // 更新陀螺仪数据
    Menu_Gryo_Update();
    
    char str[20];
    char str1[20];
    
    // 改为竖排，与原来的显示样式一致
    sprintf(str, "servo:");
    OLED_ShowString(0, 0, str, 16);
    sprintf(str1, "%.1f", fYaw);
    OLED_ShowString_Reverse(strlen(str)*8, 0, str1, 16);
    
    sprintf(str, "x:%.1f", fAngle[0]);
    OLED_ShowString(0, 2, str, 16);
    sprintf(str, "y:%.1f", fAngle[1]);
    OLED_ShowString(0, 4, str, 16);
    sprintf(str, "z:%.1f", fAngle[2]);
    OLED_ShowString(0, 6, str, 16);

    sprintf(str, " x:%.1f", fAcc[0]*10);
    OLED_ShowString(63, 2, str, 16);
    sprintf(str, " y:%.1f", fAcc[1]*10);
    OLED_ShowString(63, 4, str, 16);
    sprintf(str, " z:%.1f", fAcc[2]*10);
    OLED_ShowString(63, 6, str, 16);
    
