ybyllc/stm32-tea-lib/2_Control/menu.c
    // 舵机控制 - 每次最多移动0.5度，2度死区
    extern float servo_current_angle;
    extern float servo_target_angle;
    float target_angle = servo_current_angle + fAngle[1];
    servo_target_angle = target_angle;
    
    sprintf(str1, "%.1f", target_angle);
    OLED_ShowString_Reverse(strlen(str)*8, 0, str1, 16);
    
    OLED_Refresh();
}

/**
 * @brief 显示EC11测试页面
 */
static void Menu_DisplayEc11TestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "EC11 Test", 16);
    
    // 初始化PC6按键
    static uint8_t key_pc6_initialized = 0;
    if (!key_pc6_initialized) {
        KeyPC6_Init();
        key_pc6_initialized = 1;
    }
    
    // 获取当前计数
    int32_t currentCount = MenuInput_GetEncoderCount();
    
    // 显示计数值
    char str[20];
    sprintf(str, "Count:%4d", currentCount);
    OLED_ShowString(0, 2, str, 16);
    
    // 显示编码器按键状态
    char str1[20];
    sprintf(str1, "EncKey:%s", MenuInput_GetEncoderKeyState() ? "R" : "P");
    OLED_ShowString(0, 4, str1, 12);
    
    // 显示PC6按键状态
    sprintf(str1, "PC6Key:%s", KeyPC6_GetState() ? "R" : "P");
    OLED_ShowString(0, 5, str1, 12);
    
    // 显示提示信息
    OLED_ShowString(0, 7, "Turn & Press!", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示TOF测试页面
 */
static void Menu_DisplayTofTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "TOF Test", 16);
    
    // 首次进入时初始化TOF
    if (!tof_initialized) {
        Menu_InitTof();
    }
    
    // 读取距离（使用快速测试函数）
    u16 distance_mm = TOF_QuickTest();
    
    // 显示距离值
    char str[20];
    if (distance_mm == 0xFFFF) {
        sprintf(str, "Dist: Error");
    } else if (distance_mm <= 44) {
        // 低于 44mm，显示超出范围
        sprintf(str, "Dist: <4.4cm");
    } else if (distance_mm >= 8190) {
        // 高于 8190mm，显示超出范围
        sprintf(str, "Dist: >120cm");
    } else {
        // 正常范围，转换为 cm 显示
        float distance_cm = distance_mm / 10.0f;
        sprintf(str, "Dist:%5.1f cm", distance_cm);
    }
    OLED_ShowString(0, 2, str, 16);
    
    // 显示状态
    u8 ready = VL53L0X_IsReady();
    sprintf(str, "Status:%s", ready ? "OK" : "ERR");
    OLED_ShowString(0, 4, str, 16);
    
    // 显示提示
    OLED_ShowString(0, 6, "Long press back", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示水田遍历任务说明页面
 * @note 用于在不改 PC6 按键语义的前提下，给用户一个明确的新任务选择入口
 */
static void Menu_DisplayFieldTaskPage(void) {
    OLED_Clear(0);

    OLED_ShowString(0, 0, "Field Task", 16);
    OLED_ShowString(0, 2, "PC6:Start/Stop", 12);
    OLED_ShowString(0, 3, "TOF:Obstacle", 12);
    OLED_ShowString(0, 4, "Gyro:WIT PID", 12);
    OLED_ShowString(0, 5, "Rear motor only", 12);
    OLED_ShowString(0, 7, "Long press back", 12);

    OLED_Refresh();
}

/**
 * @brief 显示遥控器测试页面
 */
static void Menu_DisplayRemoteKeyTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "Remote Key Test", 16);

    // 首次进入时初始化遥控器
    if (!remote_key_initialized) {
        Menu_InitRemoteKey();
    }
    
    // 显示按键状态
    char str[20];
    for (uint8_t i = 0; i < REMOTE_KEY_MAX; i++) {
        uint8_t state = RemoteKey_GetState((RemoteKeyType)i);
        RemoteKeyEventType event = RemoteKey_GetEvent((RemoteKeyType)i);
        
        switch (i) {
            case REMOTE_KEY_D0:
                sprintf(str, "D0:%s", state ? "P" : "R");
                break;
            case REMOTE_KEY_D1:
                sprintf(str, "D1:%s", state ? "P" : "R");
                break;
            case REMOTE_KEY_D2:
                sprintf(str, "D2:%s", state ? "P" : "R");
                break;
            case REMOTE_KEY_D3:
                sprintf(str, "D3:%s", state ? "P" : "R");
                break;
            default:
                sprintf(str, "Unknown");
                break;
        }
        
        // 显示事件信息
        if (event != REMOTE_KEY_EVENT_NONE) {
            char event_str[10];
            switch (event) {
                case REMOTE_KEY_EVENT_SINGLE_CLICK:
                    sprintf(event_str, "S");
                    break;
                case REMOTE_KEY_EVENT_LONG_PRESS:
                    sprintf(event_str, "L");
                    break;
                case REMOTE_KEY_EVENT_LONG_PRESS_RELEASE:
                    sprintf(event_str, "LR");
                    break;
                default:
                    sprintf(event_str, "N");
                    break;
            }
            sprintf(str + strlen(str), " %s", event_str);
        }
        
        OLED_ShowString(0, (i + 1), str, 12);
    }
    
    // 显示提示
    OLED_ShowString(0, 7, "Press keys!", 12);

    OLED_Refresh();
}
/**
 * @brief 显示PPM输入测试页面
 */
static void Menu_DisplayPPMInputTestPage(void) {
    u16 channels[PPM_IN_MAX_CHANNELS] = {0};
    u8 channel_count = 0;
    u8 stick_value;
    
    OLED_Clear(0);
    OLED_ShowString(0, 0, "PPM In Test", 16);
    
    if (!ppm_initialized) {
        Menu_InitPPM();
    }
    
    if (Menu_IsPPMDriverLinked() == 0U) {
        OLED_ShowString(0, 1, "Drv:Not Linked", 12);
        OLED_ShowString(0, 3, "Add ppm_input.c", 12);
        OLED_ShowString(0, 4, "to Keil target", 12);
        OLED_Refresh();
        return;
    }
    
    if (PPM_In_GetFrame(channels, &channel_count) && PPM_In_IsOnline()) {
        // 显示状态
        OLED_ShowString(0, 1, "State:Online", 12);
        
        // 绘制前4个通道的摇杆栏
        // CH1
        if (channel_count > 0) {
            // 转换脉宽（1000-2000us）为摇杆值（0-255，128为中位）
            stick_value = (u8)((channels[0] - 1000) * 255 / 1000);
            OLED_ShowString(0, 2, "CH1:", 12);
            DrawStickBar(32, 2, 96, stick_value);
        }
        
        // CH2
        if (channel_count > 1) {
            stick_value = (u8)((channels[1] - 1000) * 255 / 1000);
            OLED_ShowString(0, 3, "CH2:", 12);
            DrawStickBar(32, 3, 96, stick_value);
        }
        
        // CH3
        if (channel_count > 2) {
            stick_value = (u8)((channels[2] - 1000) * 255 / 1000);
            OLED_ShowString(0, 4, "CH3:", 12);
            DrawStickBar(32, 4, 96, stick_value);
        }
        
        // CH4
        if (channel_count > 3) {
            stick_value = (u8)((channels[3] - 1000) * 255 / 1000);
            OLED_ShowString(0, 5, "CH4:", 12);
            DrawStickBar(32, 5, 96, stick_value);
        }
        
        // 显示通道数
        char str[24];
        sprintf(str, "Count:%u", channel_count);
        OLED_ShowString(0, 6, str, 12);
    } else {
        // 离线状态
        OLED_ShowString(0, 1, "State:Offline", 12);
        OLED_ShowString(0, 3, "Check PPM wire", 12);
        OLED_ShowString(0, 4, "and EXTI cfg", 12);
    }
    
    OLED_ShowString(0, 7, "Long press back", 12);
    OLED_Refresh();
}

/**
 * @brief 显示SBUS输入测试页面
 */
static void Menu_DisplaySBUSInputTestPage(void) {
    SBUS_InFrameTypeDef frame;
    char str[24];

    OLED_Clear(0);
    OLED_ShowString(0, 0, "SBUS In Test", 16);

