ybyllc/stm32-tea-lib/2_Control/menu.c
    if (!sbus_initialized) {
        Menu_InitSBUS();
    }

    if (Menu_IsSBUSDriverLinked() == 0U) {
        OLED_ShowString(0, 1, "Drv:Not Linked", 12);
        OLED_ShowString(0, 3, "Add sbus_input.c", 12);
        OLED_ShowString(0, 4, "to Keil target", 12);
        OLED_Refresh();
        return;
    }

    if (SBUS_In_GetFrame(&frame) && SBUS_In_IsOnline()) {
        OLED_ShowString(0, 1, "State:Online", 12);

        sprintf(str, "FS:%u Lost:%u", frame.failsafe, frame.frame_lost);
        OLED_ShowString(0, 2, str, 12);

        sprintf(str, "C1:%4u C2:%4u", frame.channels[0], frame.channels[1]);
        OLED_ShowString(0, 3, str, 12);
        sprintf(str, "C3:%4u C4:%4u", frame.channels[2], frame.channels[3]);
        OLED_ShowString(0, 4, str, 12);

        sprintf(str, "C17:%u C18:%u", frame.ch17, frame.ch18);
        OLED_ShowString(0, 6, str, 12);
    } else {
        OLED_ShowString(0, 1, "State:Offline", 12);
        OLED_ShowString(0, 3, "Check UART", 12);
        OLED_ShowString(0, 4, "100k 8E2 INV", 12);
    }

    OLED_Refresh();
}
/**
 * @brief 显示电机测试页面
 */
static void Menu_DisplayMotorTestPage(void) {
    OLED_Clear(0);
    
    // 首次进入时初始化电机
    if (!motor_initialized) {
        Menu_InitMotor();
    }
    
    char str[20];
    
    // 前左电机
    if (current_motor_index == 0) {
        OLED_ShowString(0, 0, ">", 16);
        OLED_ShowString(20, 0, "FL:", 16);
        sprintf(str, "%4d", motor_speeds[0]);
        if (motor_speed_adjust_mode && current_motor_index == 0) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 0, str, 16);
        } else {
            OLED_ShowString(52, 0, str, 16);
        }
    } else {
        OLED_ShowString(20, 0, "FL:", 16);
        sprintf(str, "%4d", motor_speeds[0]);
        OLED_ShowString(52, 0, str, 16);
    }
    
    // 前右电机
    if (current_motor_index == 1) {
        OLED_ShowString(0, 2, ">", 16);
        OLED_ShowString(20, 2, "FR:", 16);
        sprintf(str, "%4d", motor_speeds[1]);
        if (motor_speed_adjust_mode && current_motor_index == 1) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 2, str, 16);
        } else {
            OLED_ShowString(52, 2, str, 16);
        }
    } else {
        OLED_ShowString(20, 2, "FR:", 16);
        sprintf(str, "%4d", motor_speeds[1]);
        OLED_ShowString(52, 2, str, 16);
    }
    
    // 后左电机
    if (current_motor_index == 2) {
        OLED_ShowString(0, 4, ">", 16);
        OLED_ShowString(20, 4, "BL:", 16);
        sprintf(str, "%4d", motor_speeds[2]);
        if (motor_speed_adjust_mode && current_motor_index == 2) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 4, str, 16);
        } else {
            OLED_ShowString(52, 4, str, 16);
        }
    } else {
        OLED_ShowString(20, 4, "BL:", 16);
        sprintf(str, "%4d", motor_speeds[2]);
        OLED_ShowString(52, 4, str, 16);
    }
    
    // 后右电机
    if (current_motor_index == 3) {
        OLED_ShowString(0, 6, ">", 16);
        OLED_ShowString(20, 6, "BR:", 16);
        sprintf(str, "%4d", motor_speeds[3]);
        if (motor_speed_adjust_mode && current_motor_index == 3) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 6, str, 16);
        } else {
            OLED_ShowString(52, 6, str, 16);
        }
    } else {
        OLED_ShowString(20, 6, "BR:", 16);
        sprintf(str, "%4d", motor_speeds[3]);
        OLED_ShowString(52, 6, str, 16);
    }
    
    OLED_Refresh();
}

/**
 * @brief 显示编码器测试页面
 */
static void Menu_DisplayEncoderTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "Encoder Test", 16);
    
    // 初始化编码器（电机编码器，使用TIM2和TIM5）
    static uint8_t encoder_initialized = 0;
    if (!encoder_initialized) {
        Encoder_Init();
        encoder_initialized = 1;
    }
    
    // 更新编码器累计值
    encoder1_total_count += Encoder_GetCount(ENCODER_1);
    encoder2_total_count += Encoder_GetCount(ENCODER_2);
    
    // 显示编码器累计值
    char str[20];
    sprintf(str, "Enc1:%6d", encoder1_total_count);
    OLED_ShowString(0, 2, str, 16);
    
    sprintf(str, "Enc2:%6d", encoder2_total_count);
    OLED_ShowString(0, 4, str, 16);
    
    // 显示提示信息
    OLED_ShowString(0, 6, "Turn the motors", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示ADC测试页面
 */
static void Menu_DisplayAdcTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "ADC Test", 16);
    
#
    // 首次进入时初始化ADC
    if (!adc_initialized) {
        Menu_InitAdc();
    }
    
    // 启动ADC转换
    HAL_ADC_Start(&hadc1);
    
    // 等待转换完成
    HAL_ADC_PollForConversion(&hadc1, 100);
    
    // 读取ADC值
    uint32_t adc_value = HAL_ADC_GetValue(&hadc1);
    
    // 停止ADC
    HAL_ADC_Stop(&hadc1);
    
    // 转换为电压值（V）
    float voltage = (float)adc_value * 3.3f / 4095.0f;
    
    // 显示电压值
    char str[20];
    sprintf(str, "Voltage:%.2f V", voltage);
    OLED_ShowString(0, 2, str, 16);
    
    // 显示ADC原始值
    sprintf(str, "ADC Value:%4u", adc_value);
    OLED_ShowString(0, 4, str, 16);
    
    // 显示提示信息
    OLED_ShowString(0, 6, "PC4 as ADC input", 12);
    
    OLED_Refresh();
}

// PS2手柄数据结构
static JOYSTICK_TypeDef ps2_joystick;

/**
 * @brief 显示PS2手柄测试页面
 * @note 使用ax_ps2驱动，只显示按键值
 */
static void Menu_DisplayPS2TestPage(void) {
    OLED_Clear(0);
    
    // 首次进入时初始化PS2
    if (!ps2_initialized) {
        Menu_InitPS2();
    }
    
    // 按键震动反馈状态
    static uint8_t last_btn1 = 0xFF;
    static uint8_t last_btn2 = 0xFF;
    static uint32_t vibration_start_time = 0;
    static uint8_t is_vibrating = 0;
    static uint8_t motor1 = 0;
    static uint8_t motor2 = 0;
    
    // 检测按键变化
    if ((ps2_joystick.btn1 != last_btn1) || (ps2_joystick.btn2 != last_btn2)) {
        // 有按键按下时震动
        if ((ps2_joystick.btn1 != 0xFF) || (ps2_joystick.btn2 != 0xFF)) {
            motor1 = 0xFF;  // 大电机全速
            motor2 = 0x01;  // 小电机开启
            vibration_start_time = HAL_GetTick();
            is_vibrating = 1;
        }
    }
    
    // 震动持续100ms后关闭
    if (is_vibrating && (HAL_GetTick() - vibration_start_time > 100)) {
        motor1 = 0x00;  // 关闭大电机
        motor2 = 0x00;  // 关闭小电机
        is_vibrating = 0;
    }
    
