ybyllc/stm32-tea-lib/2_Control/menu.c
    last_btn1 = ps2_joystick.btn1;
    last_btn2 = ps2_joystick.btn2;
    
    // 读取PS2数据（带震动）
    AX_PS2_ScanKeyVibration(&ps2_joystick, motor1, motor2);
    
    // 显示模式和原始键值 (12号字体，第0行)
    char str[20];
    sprintf(str, "M:%02X B1:%02X B2:%02X", ps2_joystick.mode, ps2_joystick.btn1, ps2_joystick.btn2);
    OLED_ShowString(0, 0, str, 12);
    
    // 显示右摇杆数值 (第1行)
    sprintf(str, "RX:%3d RY:%3d", ps2_joystick.RJoy_LR, ps2_joystick.RJoy_UD);
    OLED_ShowString(0, 1, str, 12);
    
    // 显示左摇杆数值 (第2行)
    sprintf(str, "LX:%3d LY:%3d", ps2_joystick.LJoy_LR, ps2_joystick.LJoy_UD);
    OLED_ShowString(0, 2, str, 12);
    
    // 显示方向键状态 (第3行)
    // btn1: B0:SLCT B1:JR  B2:JL B3:STRT B4:UP B5:R B6:DOWN B7:L
    OLED_ShowString(0, 3, "DPad:", 12);
    if (ps2_joystick.btn1 & 0x10) OLED_ShowString(36, 3, "U", 12);
    else OLED_ShowString(36, 3, "-", 12);
    if (ps2_joystick.btn1 & 0x40) OLED_ShowString(48, 3, "D", 12);
    else OLED_ShowString(48, 3, "-", 12);
    if (ps2_joystick.btn1 & 0x80) OLED_ShowString(60, 3, "L", 12);
    else OLED_ShowString(60, 3, "-", 12);
    if (ps2_joystick.btn1 & 0x20) OLED_ShowString(72, 3, "R", 12);
    else OLED_ShowString(72, 3, "-", 12);
    
    // 显示按键状态 (第4行)
    // btn2: B0:L2 B1:R2 B2:L1 B3:R1 B4:Y B5:B B6:A B7:X
    OLED_ShowString(0, 4, "Key:", 12);
    if (ps2_joystick.btn2 & 0x10) OLED_ShowString(30, 4, "Y", 12);
    else OLED_ShowString(30, 4, "-", 12);
    if (ps2_joystick.btn2 & 0x20) OLED_ShowString(42, 4, "B", 12);
    else OLED_ShowString(42, 4, "-", 12);
    if (ps2_joystick.btn2 & 0x40) OLED_ShowString(54, 4, "A", 12);
    else OLED_ShowString(54, 4, "-", 12);
    if (ps2_joystick.btn2 & 0x80) OLED_ShowString(66, 4, "X", 12);
    else OLED_ShowString(66, 4, "-", 12);
    
    // 显示肩键 (第5行) - 顺序：L1 L2 R1 R2
    // btn2: B0:L2   B1:R2  B2:L1  B3:R1
    OLED_ShowString(0, 5, "L1:", 12);
    OLED_ShowString(21, 5, (ps2_joystick.btn2 & 0x04) ? "1" : "0", 12);
    OLED_ShowString(36, 5, "L2:", 12);
    OLED_ShowString(57, 5, (ps2_joystick.btn2 & 0x01) ? "1" : "0", 12);
    OLED_ShowString(69, 5, "R1:", 12);
    OLED_ShowString(90, 5, (ps2_joystick.btn2 & 0x08) ? "1" : "0", 12);
    OLED_ShowString(102, 5, "R2:", 12);
    OLED_ShowString(123, 5, (ps2_joystick.btn2 & 0x02) ? "1" : "0", 12);
    
    // 显示摇杆按下按键 (第6行) - 顺序：JR JL ST SL
    // btn1: B0:SLCT B1:JR  B2:JL B3:STRT
    OLED_ShowString(0, 6, "JR:", 12);
    OLED_ShowString(24, 6, (ps2_joystick.btn1 & 0x02) ? "1" : "0", 12);
    OLED_ShowString(36, 6, "JL:", 12);
    OLED_ShowString(60, 6, (ps2_joystick.btn1 & 0x04) ? "1" : "0", 12);
    OLED_ShowString(72, 6, "ST:", 12);
    OLED_ShowString(96, 6, (ps2_joystick.btn1 & 0x08) ? "1" : "0", 12);
    OLED_ShowString(108, 6, "SL:", 12);
    OLED_ShowString(120, 6, (ps2_joystick.btn1 & 0x01) ? "1" : "0", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示PS2控制模式页面
 * @note 使用PS2手柄摇杆控制PWM输出（航模PWM模式：50Hz，1000-2000us）
 *       左摇杆Y->B1, 左摇杆X->B0, 右摇杆Y->A7, 右摇杆X->A6
 */
static void Menu_DisplayPS2ControlPage(void) {
    static MenuPageType last_page = MENU_PAGE_MAIN;
    static uint8_t servo_initialized = 0;
    
    // 检测页面切换（从 PS2_CONTROL 切换到其他页面）
    if (last_page == MENU_PAGE_PS2_CONTROL && menuState.currentPage != MENU_PAGE_PS2_CONTROL) {
        Servo_Pwm_StopAll();
    }
    last_page = menuState.currentPage;
    
    // 如果当前不是 PS2_CONTROL 页面，直接返回
    if (menuState.currentPage != MENU_PAGE_PS2_CONTROL) {
        return;
    }
    
    OLED_Clear(0);
    
    // 首次进入时初始化PS2和舵机PWM
    if (!ps2_initialized) {
        Menu_InitPS2();
    }
    if (!servo_initialized) {
        Servo_Pwm_Init();
        servo_initialized = 1;
    }
    
    // 读取PS2数据，带死区处理
    AX_PS2_ScanKey_Deadzone(&ps2_joystick);

    // 摇杆值(0-255)转换为PWM脉宽(1000-2000us)，128为中位
    // 公式: pulse = 1500 + (stick - 128) * 500 / 127
    // 左摇杆Y -> B1
    uint16_t left_y_pwm = 1500 + (int16_t)(ps2_joystick.LJoy_UD - 128) * 500 / 127;
    // 左摇杆X -> B0
    uint16_t left_x_pwm = 1500 + (int16_t)(ps2_joystick.LJoy_LR - 128) * 500 / 127;
    // 右摇杆Y -> A7
    uint16_t right_y_pwm = 1500 + (int16_t)(ps2_joystick.RJoy_UD - 128) * 500 / 127;
    // 右摇杆X -> A6
    uint16_t right_x_pwm = 1500 + (int16_t)(ps2_joystick.RJoy_LR - 128) * 500 / 127;
    
    // 设置死区，避免摇杆中位时的抖动
    // 死区设置在摇杆里

    // 设置PWM输出
    Servo_Pwm_SetPulse(SERVO_PWM_CH_B1, left_y_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_B0, left_x_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_A7, right_y_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_A6, right_x_pwm);
    
    // 使用16号字体，每行占2个page（16像素高度）
    // 第0-1行：LX（左摇杆X轴）
    OLED_ShowString(0, 0, "LX:", 16);
    DrawStickBar(28, 4, 100, ps2_joystick.LJoy_LR);
    
    // 第2-3行：LY（左摇杆Y轴）
    OLED_ShowString(0, 2, "LY:", 16);
    DrawStickBar(28, 20, 100, ps2_joystick.LJoy_UD);
    
    // 第4-5行：RX（右摇杆X轴）
    OLED_ShowString(0, 4, "RX:", 16);
    DrawStickBar(28, 36, 100, ps2_joystick.RJoy_LR);
    
    // 第6-7行：RY（右摇杆Y轴）
    OLED_ShowString(0, 6, "RY:", 16);
    DrawStickBar(28, 52, 100, ps2_joystick.RJoy_UD);
    
    OLED_Refresh();
}
/**
 * @brief 显示舵机控制界面
 * @note 舵机运动，按时间转一圈
 *     （航模PWM模式：50Hz，1000-2000us）
 *       左摇杆Y->B1, 左摇杆X->B0, 右摇杆Y->A7, 右摇杆X->A6
 */
static void Menu_DisplayServoPWMPage(void) {
    static MenuPageType last_page = MENU_PAGE_MAIN;
    static uint8_t servo_initialized = 0;
    
    // 检测页面退出（退出到其他页面）
    if (last_page == MENU_PAGE_SERVO_PWM && menuState.currentPage != MENU_PAGE_SERVO_PWM) {
        Servo_Pwm_StopAll();
    }
    last_page = menuState.currentPage;
    
    // 如果当前不是 SERVO_PWM 页面，直接返回
    if (menuState.currentPage != MENU_PAGE_SERVO_PWM) {
        return;
    }
    
    OLED_Clear(0);
    
    // 首次进入时初始化PS2和舵机PWM
    if (!ps2_initialized) {
        Menu_InitPS2();
    }
    if (!servo_initialized) {
        Servo_Pwm_Init();
        servo_initialized = 1;
    }
    
    // 定义舵机角度变量
    static float servo_angle = 90.0f;
    static float servo_speed = 0.3f;

    // 周期旋转，换向
    if (servo_angle >= 180 || servo_angle <= 0) servo_speed = -servo_speed;

    servo_angle += servo_speed;

    // 转换为PWM脉宽(500-2500us)
    uint16_t servo_pwm = 500 + (int16_t)(servo_angle * 2000 / 180);

    // 设置PWM输出
    Servo_Pwm_SetPulse(SERVO_PWM_CH_B1, servo_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_B0, servo_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_A7, servo_pwm);
    Servo_Pwm_SetPulse(SERVO_PWM_CH_A6, servo_pwm);
    
    char str[30];
    // 使用16号字体，每行占2个page（16像素高度）
    // 第0-1行：Ag（舵机角度）
    snprintf(str, sizeof(str), "Ag:%.1f", servo_angle);
    OLED_ShowString(0, 0, str, 16);

    snprintf(str, sizeof(str), "sp:%.1f", servo_speed);
    OLED_ShowString(0, 2, str, 16);

    // 第4-5行：Ag（舵机角度）
    DrawStickBar(0, 40 , 128, (servo_angle)/180*256);

    OLED_Refresh();
}

// GPIO测试引脚状态（用函数调用次数计数）
static uint8_t gpio_cycle_counter[4] = {0, 0, 0, 0};    // 周期计数器（0-9）

// 每个引脚在10次函数调用中的高电平次数
static const uint8_t gpio_pin_high_times[4] = {1, 2, 3, 4};
#define GPIO_CYCLE_MAX  10  // 10次函数调用为一个周期

/**
 * @brief 初始化GPIO测试引脚（PC0-PC3）
 */
static void Menu_InitGPIOTest(void) {
    if (gpio_initialized) return;
    
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    
    // 启用GPIOC时钟
    __HAL_RCC_GPIOC_CLK_ENABLE();
    
    // 配置PC0-PC3为推挽输出
    GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
    
