ybyllc/stm32-tea-lib/2_Control/menu.c
    // 初始状态为低电平
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_RESET);
    
    // 初始化计数器
    for (int i = 0; i < 4; i++) {
        gpio_cycle_counter[i] = 0;
    }
    
    gpio_initialized = 1;
}

/**
 * @brief 显示GPIO测试页面
 * @note 测试PC0-PC3引脚，10次函数调用一个周期，不同引脚不同高电平次数
 */
static void Menu_DisplayGPIOTestPage(void) {
    static MenuPageType last_page = MENU_PAGE_MAIN;
    
    // 检测页面切换（从 GPIO_TEST 切换到其他页面）
    if (last_page == MENU_PAGE_GPIO_TEST && menuState.currentPage != MENU_PAGE_GPIO_TEST) {
        // 停止 PWM，将引脚设为高电平（PS2通信默认状态）
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3, GPIO_PIN_SET);
        gpio_initialized = 0;
    }
    last_page = menuState.currentPage;
    
    // 如果当前不是 GPIO_TEST 页面，直接返回
    if (menuState.currentPage != MENU_PAGE_GPIO_TEST) {
        return;
    }
    
    // 初始化GPIO（首次进入）
    if (!gpio_initialized) {
        Menu_InitGPIOTest();
    }
    
    // 先更新GPIO输出
    uint16_t pins[4] = {GPIO_PIN_0, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3};
    
    for (int i = 0; i < 4; i++) {
        // 根据计数器决定输出：计数器小于高电平次数则为高，否则为低
        if (gpio_cycle_counter[i] < gpio_pin_high_times[i]) {
            HAL_GPIO_WritePin(GPIOC, pins[i], GPIO_PIN_SET);
        } else {
            HAL_GPIO_WritePin(GPIOC, pins[i], GPIO_PIN_RESET);
        }
        
        // 计数器递增
        gpio_cycle_counter[i]++;
        if (gpio_cycle_counter[i] >= GPIO_CYCLE_MAX) {
            gpio_cycle_counter[i] = 0;
        }
    }
    
    // 显示界面
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "GPIO Test", 16);
    
    // 显示引脚信息
    OLED_ShowString(0, 2, "10 cycles PWM", 16);

    // 显示各引脚高电平次数
    char str[30];

    // 显示各引脚高电平次数
    sprintf(str, "PC0:%d   PC1:%d", 
            gpio_pin_high_times[0], gpio_pin_high_times[1]);
    OLED_ShowString(0, 4, str, 16);

    sprintf(str, "PC2:%d   PC3:%d", 
        gpio_pin_high_times[2], gpio_pin_high_times[3]);
    OLED_ShowString(0, 6, str, 16);
    
    
    OLED_Refresh();
}

/**
 * @brief 显示主菜单
 * @note 原来的样式，垂直列表布局，支持滚动
 */
static void Menu_DisplayMainMenu(void) {
    OLED_Clear(0);
    
    // 垂直行布局参数
    #define MAX_VISIBLE_ITEMS 4  // 16字大小对应4行

    // 使用记忆滚动窗口，避免上滑时光标长期停留在最底行
    static uint8_t scroll_offset = 0;
    static uint8_t last_item = 0xFF;

    if (MAIN_MENU_ITEM_COUNT <= MAX_VISIBLE_ITEMS) {
        scroll_offset = 0;
    } else {
        uint8_t max_scroll_offset = MAIN_MENU_ITEM_COUNT - MAX_VISIBLE_ITEMS;

        if (last_item == 0xFF) {
            if (menuState.currentItem > max_scroll_offset) {
                scroll_offset = max_scroll_offset;
            } else {
                scroll_offset = menuState.currentItem;
            }
        }

        if (menuState.currentItem < scroll_offset) {
            scroll_offset = menuState.currentItem;
        } else if (menuState.currentItem >= (uint8_t)(scroll_offset + MAX_VISIBLE_ITEMS)) {
            scroll_offset = menuState.currentItem - MAX_VISIBLE_ITEMS + 1;
        }

        if (scroll_offset > max_scroll_offset) {
            scroll_offset = max_scroll_offset;
        }
    }
    last_item = menuState.currentItem;
    
    // 垂直行布局，每个菜单项占一行，16字大小
    for (uint8_t i = 0; i < MAIN_MENU_ITEM_COUNT; i++) {
        // 只显示在可见范围内的菜单项
        if (i >= scroll_offset && i < scroll_offset + MAX_VISIBLE_ITEMS) {
            uint8_t display_row = i - scroll_offset;
            if (i == menuState.currentItem) {
                // 显示选中的菜单项（带方框标记）
                OLED_ShowString(0, display_row * 2, "[", 16);
                OLED_ShowString(12, display_row * 2, mainMenuItems[i].name, 16);
                OLED_ShowString(112, display_row * 2, "]", 16);
            } else {
                // 显示未选中的菜单项
                OLED_ShowString(12, display_row * 2, mainMenuItems[i].name, 16);
            }
        }
    }
    
    OLED_Refresh();
}

/**
 * @brief 显示当前页面
 */
static void Menu_DisplayCurrentPage(void) {
    switch (menuState.currentPage) {
        case MENU_PAGE_MAIN:
            Menu_DisplayMainMenu();
            break;
        case MENU_PAGE_GYRO:
            Menu_DisplayGyroPage();
            break;
        case MENU_PAGE_EC11_TEST:
            Menu_DisplayEc11TestPage();
            break;
        case MENU_PAGE_TOF_TEST:
            Menu_DisplayTofTestPage();
            break;
        case MENU_PAGE_FIELD_TASK:
            Menu_DisplayFieldTaskPage();
            break;
        case MENU_PAGE_REMOTE_KEY_TEST:
            Menu_DisplayRemoteKeyTestPage();
            break;
        case MENU_PAGE_PPM_INPUT_TEST:
            Menu_DisplayPPMInputTestPage();
            break;
        case MENU_PAGE_SBUS_INPUT_TEST:
            Menu_DisplaySBUSInputTestPage();
            break;
        case MENU_PAGE_MOTOR_TEST:
            Menu_DisplayMotorTestPage();
            break;
        case MENU_PAGE_ENCODER_TEST:
            Menu_DisplayEncoderTestPage();
            break;
        case MENU_PAGE_ADC_TEST:
            Menu_DisplayAdcTestPage();
            break;
        case MENU_PAGE_PS2_TEST:
            Menu_DisplayPS2TestPage();
            break;
        case MENU_PAGE_PS2_CONTROL:
            Menu_DisplayPS2ControlPage();
            break;
        case MENU_PAGE_SERVO_PWM:
            Menu_DisplayServoPWMPage();
            break;
        case MENU_PAGE_GPIO_TEST:
            Menu_DisplayGPIOTestPage();
            break;
        default:
            Menu_DisplayMainMenu();
            break;
    }
}


